// Generated by jextract

package dev.mccue.ygo.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct OCG_NewCardInfo {
 *     uint8_t team;
 *     uint8_t duelist;
 *     uint32_t code;
 *     uint8_t con;
 *     uint32_t loc;
 *     uint32_t seq;
 *     uint32_t pos;
 * }
 * }
 */
public class OCG_NewCardInfo {

    OCG_NewCardInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        yugioh_h.C_CHAR.withName("team"),
        yugioh_h.C_CHAR.withName("duelist"),
        MemoryLayout.paddingLayout(2),
        yugioh_h.C_INT.withName("code"),
        yugioh_h.C_CHAR.withName("con"),
        MemoryLayout.paddingLayout(3),
        yugioh_h.C_INT.withName("loc"),
        yugioh_h.C_INT.withName("seq"),
        yugioh_h.C_INT.withName("pos")
    ).withName("OCG_NewCardInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfByte team$LAYOUT = (OfByte)$LAYOUT.select(groupElement("team"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t team
     * }
     */
    public static final OfByte team$layout() {
        return team$LAYOUT;
    }

    private static final long team$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t team
     * }
     */
    public static final long team$offset() {
        return team$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t team
     * }
     */
    public static byte team(MemorySegment struct) {
        return struct.get(team$LAYOUT, team$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t team
     * }
     */
    public static void team(MemorySegment struct, byte fieldValue) {
        struct.set(team$LAYOUT, team$OFFSET, fieldValue);
    }

    private static final OfByte duelist$LAYOUT = (OfByte)$LAYOUT.select(groupElement("duelist"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t duelist
     * }
     */
    public static final OfByte duelist$layout() {
        return duelist$LAYOUT;
    }

    private static final long duelist$OFFSET = 1;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t duelist
     * }
     */
    public static final long duelist$offset() {
        return duelist$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t duelist
     * }
     */
    public static byte duelist(MemorySegment struct) {
        return struct.get(duelist$LAYOUT, duelist$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t duelist
     * }
     */
    public static void duelist(MemorySegment struct, byte fieldValue) {
        struct.set(duelist$LAYOUT, duelist$OFFSET, fieldValue);
    }

    private static final OfInt code$LAYOUT = (OfInt)$LAYOUT.select(groupElement("code"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t code
     * }
     */
    public static final OfInt code$layout() {
        return code$LAYOUT;
    }

    private static final long code$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t code
     * }
     */
    public static final long code$offset() {
        return code$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t code
     * }
     */
    public static int code(MemorySegment struct) {
        return struct.get(code$LAYOUT, code$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t code
     * }
     */
    public static void code(MemorySegment struct, int fieldValue) {
        struct.set(code$LAYOUT, code$OFFSET, fieldValue);
    }

    private static final OfByte con$LAYOUT = (OfByte)$LAYOUT.select(groupElement("con"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t con
     * }
     */
    public static final OfByte con$layout() {
        return con$LAYOUT;
    }

    private static final long con$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t con
     * }
     */
    public static final long con$offset() {
        return con$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t con
     * }
     */
    public static byte con(MemorySegment struct) {
        return struct.get(con$LAYOUT, con$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t con
     * }
     */
    public static void con(MemorySegment struct, byte fieldValue) {
        struct.set(con$LAYOUT, con$OFFSET, fieldValue);
    }

    private static final OfInt loc$LAYOUT = (OfInt)$LAYOUT.select(groupElement("loc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t loc
     * }
     */
    public static final OfInt loc$layout() {
        return loc$LAYOUT;
    }

    private static final long loc$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t loc
     * }
     */
    public static final long loc$offset() {
        return loc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t loc
     * }
     */
    public static int loc(MemorySegment struct) {
        return struct.get(loc$LAYOUT, loc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t loc
     * }
     */
    public static void loc(MemorySegment struct, int fieldValue) {
        struct.set(loc$LAYOUT, loc$OFFSET, fieldValue);
    }

    private static final OfInt seq$LAYOUT = (OfInt)$LAYOUT.select(groupElement("seq"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t seq
     * }
     */
    public static final OfInt seq$layout() {
        return seq$LAYOUT;
    }

    private static final long seq$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t seq
     * }
     */
    public static final long seq$offset() {
        return seq$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t seq
     * }
     */
    public static int seq(MemorySegment struct) {
        return struct.get(seq$LAYOUT, seq$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t seq
     * }
     */
    public static void seq(MemorySegment struct, int fieldValue) {
        struct.set(seq$LAYOUT, seq$OFFSET, fieldValue);
    }

    private static final OfInt pos$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pos"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t pos
     * }
     */
    public static final OfInt pos$layout() {
        return pos$LAYOUT;
    }

    private static final long pos$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t pos
     * }
     */
    public static final long pos$offset() {
        return pos$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t pos
     * }
     */
    public static int pos(MemorySegment struct) {
        return struct.get(pos$LAYOUT, pos$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t pos
     * }
     */
    public static void pos(MemorySegment struct, int fieldValue) {
        struct.set(pos$LAYOUT, pos$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

